trans.addDict([
    [300, 0, "on/off"], [300, 1, "вкл/выкл"],
    [301, 0, "prog. on/off"], [301, 1, "прог. вкл/выкл"],
    [302, 0, "busy time"], [302, 1, "время работы"],
    [303, 0, "executive mechanism"], [303, 1, "исполнительный механизм"],
    [304, 0, "program"], [304, 1, "программа"],
    [305, 0, "on"], [305, 1, "вкл"],
    [306, 0, "off"], [306, 1, "выкл"],
    [307, 0, "update"], [307, 1, "обновить"],
    [308, 0, "controller state"], [308, 1, "состояние контроллера"],
    [309, 0, "reset"], [309, 1, "сброс"],
    [310, 0, "unload"], [310, 1, "выгрузить"],
    [311, 0, "reset"], [311, 1, "сброс"],
    [312, 0, "edit"], [312, 1, "редактировать"],
    [313, 0, "controller time: "], [313, 1, "время контроллера: "],
    [314, 0, "regulator"], [314, 1, "регулятор"],
    [315, 0, "heater"], [315, 1, "нагреватель"],
    [316, 0, "cooler"], [316, 1, "охладитель"],
    [317, 0, "start"], [317, 1, "старт"],
    [318, 0, "goal"], [318, 1, "цель"],
    [319, 0, "delta"], [319, 1, "дельта"],
    [320, 0, "EM change gap"], [320, 1, "время переключения ИМ"],
    [321, 0, "heater delta"], [321, 1, "дельта нагревателя"],
    [322, 0, "cooler delta"], [322, 1, "дельта охладителя"],
    [323, 0, "regulator"], [323, 1, "регулятор"],
    [324, 0, "get settings"], [324, 1, "получить настройки"],
    [325, 0, "power"], [325, 1, "мощность"],
    [326, 0, "set power"], [326, 1, "установить мощность"],
    [327, 0, "switch state"], [327, 1, "переключить состояние"],
    [329, 0, "use"], [329, 1, "использовать"]
]);
//menu
trans.addDict([
    [400, 0, "regulator onf"], [400, 1, "регулятор onf"],
    [401, 0, "climate control"], [401, 1, "управление климатом"],
    [402, 0, "help"], [402, 1, "помощь"],
    [403, 0, "settings"], [403, 1, "настройки"],
    [404, 0, "on/off factors"], [404, 1, "вкл/выкл коэффициенты"],
    [405, 0, "edit"], [405, 1, "редактировать"],
    [406, 0, "program"], [406, 1, "программа"],
    [407, 0, "PID factors"], [407, 1, "ПИД коэффициенты"]
]);

//error
trans.addDict([
    [250, 0, "failed to get data from database"], [250, 1, "не удалось получить данные из базы данных"],
    [251, 0, "failed to send command to controller"], [251, 1, "не удалось отправить команду контроллеру"],
    [252, 0, "controller is active"], [252, 1, "контроллер активен"],
    [253, 0, "controller is at standby mode and not ready for valve control"], [253, 1, "контроллер находится в режиме ожидания и не готов управлять клапанами"],
    [254, 0, "failed to get response from controller"], [254, 1, "не удалось получить ответ от контроллера"],
    [255, 0, "unknown response from controller"], [255, 1, "неизвестный ответ от контроллера"],
    [256, 0, "broken connection with one of modules"], [256, 1, "нет связи с одним из модулей"],
    [257, 0, "failed to save"], [257, 1, "не удалось сохранить"],
    [258, 0, "failed to get program name"], [258, 1, "не удалось узнать имя программы"],
    [259, 0, "failed to set goal for regonf"], [259, 1, "не удалось сохранить цель для регулятора"],
    [260, 0, "failed to set delta for regonf"], [260, 1, "не удалось сохранить дельту для регулятора"],
    [261, 0, "failed to set goal for alr"], [261, 1, "не удалось сохранить цель для проверщика"],
    [262, 0, "failed to set delta for alr"], [262, 1, "не удалось сохранить дельту для проверщика"],
    [263, 0, "failed to enable regonf prog"], [263, 1, "не удалось активировать программу для регулятора"],
    [264, 0, "failed to disable regonf prog"], [264, 1, "не удалось деактивировать программу для регулятора"],
    [265, 0, "failed to enable lgr prog"], [265, 1, "не удалось активировать программу для регистратора"],
    [266, 0, "failed to disable lgr prog"], [266, 1, "не удалось деактивировать программу для регистратора"],
    [267, 0, "failed to set sms"], [267, 1, "не удалось установить СМС"],
    [268, 0, "failed to set ring"], [268, 1, "не удалось установить дозвон"],
    [269, 0, "data shift"], [269, 1, "сдвиг данных"],
    [270, 0, "failed to set EM change gap for regonf"], [270, 1, "не удалось сохранить время переключения ИМ для регулятора"],
    [271, 0, "failed to set heater power for regonf"], [271, 1, "не удалось сохранить мощность нагревателя для регулятора"],
    [272, 0, "failed to set cooler power for regonf"], [272, 1, "не удалось сохранить мощность охладителя для регулятора"],
    [273, 0, "failed to set value for regonf"], [273, 1, "не удалось сохранить параметр для регулятора"]
]);




